import pandas as pd
import ml_sf

row_data = {
    '姓名': ['刘华', '毛晓彤', '李欣桐', '张宇', '李华宇', '刘嘉欣', '郑嘉宜', '李梦秋', '张波'],
    '性别': ['男', '女', '女', '男', '男', '女', '女', '女', '男'],
    '年龄': [50, 32, 28, 24, 27, 23, 34, 39, 33],
    '身高': [175, 160, 164, 166, 160, 172, 164, 155, 181],
    '体重': [69, 44, 55, 65, 78, 81, 67, 44, 59],
    'BMI状态': ['标准', '偏瘦', '标准', '标准', '过重', '偏重', '偏重', '偏瘦', '偏瘦']
}
bmi_data = pd.DataFrame(row_data)
new_data = [167, 53]
k = 6
result = ml_sf.classify0(new_data, bmi_data, k)
print(result)



